[
  {
    "title": "Cheshire",
    "text": "Cheshire is a county in England. It is the North West part of the country. It is most famous for making salt and cheese. Cheshire is made up of lots of little towns including the Borough of Macclesfield which covers a large area of plains. The main attraction is in Kerridge where there is the famous landmark 'White Nancy.'"
  },
  {
    "title": "Mundilfari",
    "text": "Mundilfari (Mundilfäri) (Old Norse, possibly \"the one moving according to particular times\") is in Norse mythology a father of Sól (Sun) and Máni (Moon). One moon is named after him."
  },
  {
    "title": "Naked singularity",
    "text": "In general relativity, a naked singularity is a gravitational singularity that is viewable from the outside. The event horizon is like a bubble which surrounds a black hole. Inside the event horizon, the pull of the light cannot escape, so we are unable to view objects inside the event horizon. This includes the event horizon itself. Naked singularities do not have an event horizon, hence the term 'naked'."
  },
  {
    "title": "Orbital revolution",
    "text": "Orbital revolution is the movement of a planet around a star, or a moon around a planet. For example, the Earth revolves around the Sun, and the Moon revolves about the Earth."
  },
  {
    "title": "Phases of the Moon",
    "text": "As the Moon orbits around the Earth, the half of the Moon that faces the Sun will be lit up. The different shapes of the lit portion of the Moon that can be seen from Earth are known as phases of the Moon. Each phase repeats itself every 29.5 days."
  },
  {
    "title": "Pokémon Ultra Sun and Ultra Moon",
    "text": "Pokémon Ultra Sun and Ultra Moon is a game in the 7th generation of \"Pokémon\". It was released on the Nintendo 3DS in 2017."
  },
  {
    "title": "Solar eclipse",
    "text": "As seen from Earth, a solar eclipse /\"ee-klips\"/ happens when the Moon is directly between the Earth and the Sun. This makes the Moon fully or partially (partly) cover the sun. Solar eclipses can only happen during a new moon. Every year there are about two solar eclipses. Sometimes there are even five solar eclipses in a year. However, only two of these can be total solar eclipses, and often a year will pass without a total eclipse."
  },
  {
    "title": "Solar eclipse of December 14, 2020",
    "text": "A total solar eclipse occurred on Monday, December 14, 2020. A solar eclipse occurs when the Moon passes between Earth and the Sun, which will cover the image of the Sun for a viewer on Earth."
  },
  {
    "title": "Sun and moon letters",
    "text": "In Arabic and Maltese, consonants are divided into two groups: the sun/solar letters ( ', Maltese: konsonanti xemxin) and moon/lunar letters ( ', Maltese: konsonanti qamrin)."
  },
  {
    "title": "Sun Moon Lake",
    "text": "Sun Moon Lake (; Thao: \"Zintun\") is a lake in Nantou County, Taiwan. It is the largest lake in Taiwan. Sun Moon Lake is one of the Eight Views of Taiwan. The lake was named because the east side of the lake looks like a sun, and the west side of the lake looks like a moon."
  },
  {
    "title": "Unification Church",
    "text": "The Unification Church is a religious movement started by Sun Myung Moon in Korea in the 1940s. It officially began as a church in 1954 in Seoul, South Korea. On October 12, 2009, it was announced that Sun Myung Moon was given the church to his sons, Moon Hyung-jin, Moon Kook-jin, and Moon Hyun-jin."
  }
]
